microsoft/uf2-samdx1/lib/saml21/Atmel.SAML21_DFP.pdsc
      <component Cvendor="Atmel"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="ATSAML21E18B">
         <description>Headers and startup code for Atmel ATSAML21E18B</description>
         <files>
            <file condition="C" category="include" name="saml21b/include"/>
            <file condition="C" category="header" name="saml21b/include/sam.h"/>
            <file condition="C Exe"
                  category="source"
                  name="saml21b/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="saml21b/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="saml21b/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="saml21b/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="saml21b/gcc/system_saml21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="saml21b/gcc/gcc/startup_saml21.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="saml21b/gcc/gcc/saml21e18b_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="saml21b/gcc/gcc/saml21e18b_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="saml21b/armcc/Device/SAML21B/Source/system_saml21.c"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="saml21b/armcc/Device/SAML21B/Source/ARM/startup_SAML21.s"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="saml21b/iar/system_saml21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="saml21b/iar/iar/startup_saml21.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="saml21b/iar/iar/saml21e18b_flash.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="saml21b/iar/iar/saml21e18b_sram.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
